Revit 2027 API
RebarHandlePositionData.SetPosition Method
 Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPosition(
	int handleTag,
	XYZ position
)
Public Sub SetPosition (
	handleTag As Integer,
	position As XYZ
)
public:
void SetPosition(
	int handleTag,
	XYZ^ position
)
member SetPosition :
        handleTag : int *
        position : XYZ -> unit
Parameters
handleTag Int32
 The tag of the handle.
position XYZ
 Position of the handle.
Exceptions
Exception | Condition
ArgumentException |  The input point lies outside of Revit design limits.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace